{
	"libraries":[
		{
			"name":"Chi-squared test",
			"file":"chisq.R",
			"type":["categorical"],
			"description":{
				"summary":"For comparison between two categorical variables",
				"detail":{
					"information":"The chi-squared test is used when both variables being tested are categorical.",
					"assumption":"The test assumes that observations are not correlated and at least 80% of the expected cell counts of the contingency table are greater than 5",
					"hypothesis":"The null hypothesis is that the proportions of one variable are independent of the other variable.",
					"notes":"It is used to test for independence between the two variables when sample sizes are large. The chi-squared test of homogeneity is performed using the same method as the chi-squared test of independence. The null hypothesis for the chi-squared test of homogeneity is that the proportions between the two groups are the same. The chi-squared test of independence is used when two samples are chosen, then measurements are taken. The chi-squared test of homogeneity is used when random subsets of particular groups are chosen (where groups are defined by a measure that has already been taken) and then another measurement is taken of a different variable."
				}
			},
			"data_format":["character","numeric"],
			"author":{
				"name":"Kaitlin Cornwell",
				"email":"kaitlin.cornwell@pnnl.gov",
				"github_login":"kaitcorn",
				"organization":"Pacific Northwest National Laboratory"
			},
			"created":"06-27-2016",
			"last_update":"06-28-2016"
		},
		{
			"name":"Fisher's exact test",
			"file":"fisher.R",
			"type":["categorical"],
			"description":{
				"summary":"For comparison between two categorical variables.",
				"detail":{
					"information":"Fisher's exact test is used when both variables being tested are categorical.",
					"assumption":"Fisher's exact test assumes that each observation only fits into one cell and that the row and column totals are fixed and not random.",
					"hypothesis":"The null hypothesis is that the proportions of one varaible are independent of the other variable.",
					"notes":"It is used to test for independence between the two variables, when sample sizes are small."
				}
			},
			"data_format":["character","numeric"],
			"author":{
				"name":"Kaitlin Cornwell",
				"email":"kaitlin.cornwell@pnnl.gov",
				"github_login":"kaitcorn",
				"organization":"Pacific Northwest National Laboratory"
			},
			"created":"06-28-2016",
			"last_update":"06-28-2016"
		},
		{
			"name":"Kaplan-Meier with Log Rank test",
			"file":"kaplan_meier.R",
			"type":["time to event"],
			"description":{
				"summary":"For comparison between time to event and categorical varaibles.",
				"detail":{
					"information":"A Kaplan-Meier analysis is used when one varaible is time to event and the other is continuous",
					"assumption":"It assumes that censoring is unrelated to prognosis, that survival probabilities are the same (regardless of early or late recruitment into the study), and that events happened at the times specified.",
					"hypothesis":"The null hypothesis is that the two Kaplan-Meier curves are the same.",
					"notes":"The log-rank test is used to test for differences in the survival times/probabilities calcualted using the Kaplan-Meier method. Data can be left, right, or interval censored, although this Rsnippet is for use with right censored data."
				}
			},
			"data_format":["string","a/b"],
			"author": {
				"name":"Kaitlin Cornwell",
				"email":"kaitlin.cornwell@pnnl.gov",
				"github_login":"kaitcorn",
				"organization":"Pacific Northwest National Laboratory"
			},
			"created":"06-08-2016",
			"last_update":"06-29-2016"
		},
		{
			"name":"Two-sample t-test",
			"file":"t-test.R",
			"type":["continuous"],
			"description":{
				"summary":"For comparison between continuous and categorical variables",
				"detail": {
					"information":"A two-sample t-test is used for comparison between continuous and categorical variables",
					"assumption":"This test assumes that samples have been drawn from normally distributed popluations and that the popluations have equal variances.",
					"hypothesis":"The null hypothesis is that the means are equal.",
					"notes":"The two-sample t-test is used to test for differences in mean between the groups defined by the categorical variable. Since this test uses the mean, the two-sample t-test should not be chosen when the data is signifcanly skewed."
				}
			},
			"data_format":["numeric"],
			"author":{
				"name":"Kaitlin Cornwell",
				"email":"kaitlin.cornwell@pnnl.gov",
				"github_login":"kaitcorn",
				"organization":"Pacific Northwest National Laboratory"
			},
			"created":"06-03-2016",
			"last_update":"06-27-2016"
		},
		{
			"name":"Wilcoxon rank-sum test",
			"file":"wilcoxon.R",
			"type":["coninuous","ordinal"],
			"description":{
				"summary":"For comparison between continuous or ordinal and categorical varaibles",
				"detail":{
					"information":"The Wilcoxon rank-sum test is used for comparison between one continuous or ordinal variable and a categorical variable.",
					"assumption":"This test assumes that that one variable is either continuous or ordinal and one variable is categorical with two groups, that the groups within the categorical varaible are independent, and that observations are independent.",
					"hypothesis":"The null hypothesis is that the groups are identically distributed.",
					"notes":"The two sample Wilcoxon rank sum test is used as an alternative to the two-sample t-test when the data is not normally distributed, the sample size is small, or when one variable is ordinal. If the distributions of the two groups are not similar then the Wilcoxon rank sum test determines if the distributions are significantly different. If the two distributions are similar then the test determines if the medians of the two groups are significantly different."
				}
			},
			"data_format":["numeric"],
			"author": {
				"name":"Kaitlin Cornwell",
				"email":"kaitlin.cornwell@pnnl.gov",
				"github_login":"kaitcorn",
				"organization":"Pacific Northwest National Laboratory"
			},
			"created":"06-03-2016",
			"last_update":"06-29-2016"
		}
	]
}
